app/controllers/posts_controller.rb

UPDATE "posts" SET "dislike_count" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["dislike_count", 1], ["updated_at", "2015-03-31 17:26:19.617861"]]
---
  def dislike
    if @post.dislike_count.nil?
      @post.dislike_count = 0
    end
    @post.dislike_count = @post.dislike_count + 1
    @post.save

INSERT INTO "posts" ("created_at", "description", "photo", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-03-31 17:29:34.357014"], ["description", "Wateerfall"], ["photo", "Shifen-Waterfall.jpg"], ["updated_at", "2015-03-31 17:29:34.357014"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save